Repository: reflex229/ConsoleNot
Catalog: ConsoleNot/Lang/langres.*.resx
Languages: ru

# Commands_Help_
source: -m Sets delay in minutes. -s Sets delay in seconds. -h Sets delay in hours. -t The title of the notification. -d The description of the notification -c The count of iterations (default value is 1). --client Enables client mode (you will have to enter a server's port and IP). You can always stop the program by pressing Ctrl+C.
ru: -m Устанавливает задержку в минутах. -s Устанавливает задержку в секундах. -h Устанавливает задержку в часах. -t Заголовок уведомления. -d Описание уведомления. -c Количество итераций (значение по умолчанию - 1). --client Включает режим клиента (вам придётся ввести IP и порт сервера). Вы всегда можете завершить работу программы нажав Ctrl+C.

# There_is_no_
source: There is no arguments given. Exiting the program. Please, enter an arguments (see --help) and try again.
ru: Не задано никаких аргументов. Пожалуйста, введите аргументы (смотрите --help). Для выхода нажмите Enter.

# Enter_Title
source: Enter a title:
ru: Введите заголовок:

# Enter_Description
source: Enter a description:
ru: Введите описание:

# Sorry_OS
source: Sorry, your operating system is not supported.
ru: Извините, ваша ОС не поддерживается программой.

# Only_Numbers
source: Error, you should only enter numbers (ex. -c 10).
ru: Ошибка, вам следует вводить только числа (пример -c 10).

# Success
source: The program has been successfully started. Total delay is {0} seconds, iterations count is {1}.
ru: Программа успешно запущена. Общая задержка в секундах - {0}, общее количество итераций - {1}.

# Title
source: A Notification
ru: Уведомление

# Config_Error
source: Error, maybe the file "ConsoleNot.dll.config" is damaged.
ru: Ошибка, возможно файл "ConsoleNot.dll.config" был повреждён.

# Server_Error
source: Server error. The destination point is unreachable. IP is: {0}, port is:{1}.
ru: Ошибка сервера. Цель недостижима. IP: {0}, порт: {1}.

# Client_Exception
source: Error. Exception message: {0}
ru: Ошибка. Сообщение исключения: {0}

# Enter_Port
source: Enter server's port:
ru: Введите порт сервера:

# Enter_IP
source: Enter server's IP address:
ru: Введите IP адрес сервера:

# Notify_Ex
source: Error. Most likely you do not have the dependency "notify-send" installed.
ru: Ошибка. Скорее всего, зависимость "notify-send" не установлена.
